Revit 2024 API
BuiltInFailures.SiteFailures Class
 Failures about Site.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SiteFailures
Visual Basic
Public NotInheritable Class SiteFailures
Visual C++
public ref class SiteFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SiteFailures
See Also
BuiltInFailures.SiteFailures Members
Autodesk.Revit.DB Namespace